window.onload = function() {
    /**
     * 配置文件
     */
    // 歌曲来源：来自网易云音乐歌单信息请填 true ，来自本地自定义歌曲信息请填 false 。
    IcePlayer.musicSource = true;
    // 自动播放
    IcePlayer.autoPlay = true;
    IcePlayer.defaultShow = true;
    // 网易云歌单ID：登陆网页版网易云音乐，进入歌单详情后，在url中可找到歌单id，例：'http://music.163.com/#/playlist?id=445719932')。
    IcePlayer.netEasePlayListId = 445719932;


    /**
     * 自定义歌曲信息
     */
    IcePlayer.localList = [{
        src: 'http://niices.qiniudn.com/%E5%B0%8F%E5%B9%B8%E8%BF%90.mp3',
        cover: 'http://my-typecho-blog.b0.upaiyun.com/usr/uploads/2016/02/462344463.jpg',
        title: '小幸运',
        author: '田馥甄',
        lrc: '[00:03.00]小幸运\n[00:06.01]\n[00:09.41]作词：徐世珍，吴辉福 作曲：JerryC\n[00:12.55]演唱：田馥甄\n[00:14.78]\n[00:16.00]我听见雨滴落在青青草地\n[00:21.87]我听见远方下课钟声响起\n[00:27.87]可是我没有听见你的声音\n[00:32.98]认真 呼唤我姓名\n[00:40.09]爱上你的时候还不懂感情\n[00:46.15]离别了才觉得刻骨 铭心\n[00:52.19]为什么没有发现遇见了你\n[00:56.70]是生命最好的事情\n[01:02.52]也许当时忙着微笑和哭泣\n[01:08.50]忙着追逐天空中的流星\n[01:14.26]人理所当然的忘记\n[01:18.79]是谁风里雨里一直默默守护在原地\n[01:26.52]原来你是我最想留住的幸运\n[01:31.73]原来我们和爱情曾经靠得那么近\n[01:37.74]那为我对抗世界的决定\n[01:42.30]那陪我淋的雨\n[01:45.53]一幕幕都是你 一尘不染的真心\n[01:52.79]与你相遇 好幸运\n[01:56.41]可我已失去为你泪流满面的权利\n[02:02.00]但愿在我看不到的天际\n[02:06.61]你张开了双翼\n[02:09.68]遇见你的注定 (oh--)\n[02:14.57]她会有多幸运\n[02:29.54]青春是段跌跌撞撞的旅行\n[02:35.47]拥有着后知后觉的美丽\n[02:41.58]来不及感谢是你给我勇气\n[02:46.15]让我能做回我自己\n[02:51.93]也许当时忙着微笑和哭泣\n[02:57.81]忙着追逐天空中的流星\n[03:03.52]人理所当然的忘记\n[03:08.14]是谁风里雨里一直默默守护在原地\n[03:16.00]原来你是我最想留住的幸运\n[03:21.04]原来我们和爱情曾经靠得那么近\n[03:27.10]那为我对抗世界的决定\n[03:31.87]那陪我淋的雨\n[03:34.64]一幕幕都是你 一尘不染的真心\n[03:42.24]与你相遇 好幸运\n[03:45.27]可我已失去为你泪流满面的权利\n[03:51.42]但愿在我看不到的天际\n[03:55.94]你张开了双翼\n[03:59.21]遇见你的注定 (oh--)\n[04:06.83]她会有多幸运\n'
    }, {
        src: 'http://niices.qiniudn.com/%E5%B0%8F%E5%B9%B8%E8%BF%90.mp3',
        cover: 'http://my-typecho-blog.b0.upaiyun.com/usr/uploads/2016/02/462344463.jpg',
        title: '小幸运',
        author: '田馥甄',
        lrc: '[00:03.00]小幸运\n[00:06.01]\n[00:09.41]作词：徐世珍，吴辉福 作曲：JerryC\n[00:12.55]演唱：田馥甄\n[00:14.78]\n[00:16.00]我听见雨滴落在青青草地\n[00:21.87]我听见远方下课钟声响起\n[00:27.87]可是我没有听见你的声音\n[00:32.98]认真 呼唤我姓名\n[00:40.09]爱上你的时候还不懂感情\n[00:46.15]离别了才觉得刻骨 铭心\n[00:52.19]为什么没有发现遇见了你\n[00:56.70]是生命最好的事情\n[01:02.52]也许当时忙着微笑和哭泣\n[01:08.50]忙着追逐天空中的流星\n[01:14.26]人理所当然的忘记\n[01:18.79]是谁风里雨里一直默默守护在原地\n[01:26.52]原来你是我最想留住的幸运\n[01:31.73]原来我们和爱情曾经靠得那么近\n[01:37.74]那为我对抗世界的决定\n[01:42.30]那陪我淋的雨\n[01:45.53]一幕幕都是你 一尘不染的真心\n[01:52.79]与你相遇 好幸运\n[01:56.41]可我已失去为你泪流满面的权利\n[02:02.00]但愿在我看不到的天际\n[02:06.61]你张开了双翼\n[02:09.68]遇见你的注定 (oh--)\n[02:14.57]她会有多幸运\n[02:29.54]青春是段跌跌撞撞的旅行\n[02:35.47]拥有着后知后觉的美丽\n[02:41.58]来不及感谢是你给我勇气\n[02:46.15]让我能做回我自己\n[02:51.93]也许当时忙着微笑和哭泣\n[02:57.81]忙着追逐天空中的流星\n[03:03.52]人理所当然的忘记\n[03:08.14]是谁风里雨里一直默默守护在原地\n[03:16.00]原来你是我最想留住的幸运\n[03:21.04]原来我们和爱情曾经靠得那么近\n[03:27.10]那为我对抗世界的决定\n[03:31.87]那陪我淋的雨\n[03:34.64]一幕幕都是你 一尘不染的真心\n[03:42.24]与你相遇 好幸运\n[03:45.27]可我已失去为你泪流满面的权利\n[03:51.42]但愿在我看不到的天际\n[03:55.94]你张开了双翼\n[03:59.21]遇见你的注定 (oh--)\n[04:06.83]她会有多幸运\n'
    }, {
        src: 'http://niices.qiniudn.com/%E5%B0%8F%E5%B9%B8%E8%BF%90.mp3',
        cover: 'http://my-typecho-blog.b0.upaiyun.com/usr/uploads/2016/02/462344463.jpg',
        title: '小幸运',
        author: '田馥甄',
        lrc: '[00:03.00]小幸运\n[00:06.01]\n[00:09.41]作词：徐世珍，吴辉福 作曲：JerryC\n[00:12.55]演唱：田馥甄\n[00:14.78]\n[00:16.00]我听见雨滴落在青青草地\n[00:21.87]我听见远方下课钟声响起\n[00:27.87]可是我没有听见你的声音\n[00:32.98]认真 呼唤我姓名\n[00:40.09]爱上你的时候还不懂感情\n[00:46.15]离别了才觉得刻骨 铭心\n[00:52.19]为什么没有发现遇见了你\n[00:56.70]是生命最好的事情\n[01:02.52]也许当时忙着微笑和哭泣\n[01:08.50]忙着追逐天空中的流星\n[01:14.26]人理所当然的忘记\n[01:18.79]是谁风里雨里一直默默守护在原地\n[01:26.52]原来你是我最想留住的幸运\n[01:31.73]原来我们和爱情曾经靠得那么近\n[01:37.74]那为我对抗世界的决定\n[01:42.30]那陪我淋的雨\n[01:45.53]一幕幕都是你 一尘不染的真心\n[01:52.79]与你相遇 好幸运\n[01:56.41]可我已失去为你泪流满面的权利\n[02:02.00]但愿在我看不到的天际\n[02:06.61]你张开了双翼\n[02:09.68]遇见你的注定 (oh--)\n[02:14.57]她会有多幸运\n[02:29.54]青春是段跌跌撞撞的旅行\n[02:35.47]拥有着后知后觉的美丽\n[02:41.58]来不及感谢是你给我勇气\n[02:46.15]让我能做回我自己\n[02:51.93]也许当时忙着微笑和哭泣\n[02:57.81]忙着追逐天空中的流星\n[03:03.52]人理所当然的忘记\n[03:08.14]是谁风里雨里一直默默守护在原地\n[03:16.00]原来你是我最想留住的幸运\n[03:21.04]原来我们和爱情曾经靠得那么近\n[03:27.10]那为我对抗世界的决定\n[03:31.87]那陪我淋的雨\n[03:34.64]一幕幕都是你 一尘不染的真心\n[03:42.24]与你相遇 好幸运\n[03:45.27]可我已失去为你泪流满面的权利\n[03:51.42]但愿在我看不到的天际\n[03:55.94]你张开了双翼\n[03:59.21]遇见你的注定 (oh--)\n[04:06.83]她会有多幸运\n'
    }, {
        src: 'http://niices.qiniudn.com/%E5%B0%8F%E5%B9%B8%E8%BF%90.mp3',
        cover: 'http://my-typecho-blog.b0.upaiyun.com/usr/uploads/2016/02/462344463.jpg',
        title: '小幸运',
        author: '田馥甄',
        lrc: '[00:03.00]小幸运\n[00:06.01]\n[00:09.41]作词：徐世珍，吴辉福 作曲：JerryC\n[00:12.55]演唱：田馥甄\n[00:14.78]\n[00:16.00]我听见雨滴落在青青草地\n[00:21.87]我听见远方下课钟声响起\n[00:27.87]可是我没有听见你的声音\n[00:32.98]认真 呼唤我姓名\n[00:40.09]爱上你的时候还不懂感情\n[00:46.15]离别了才觉得刻骨 铭心\n[00:52.19]为什么没有发现遇见了你\n[00:56.70]是生命最好的事情\n[01:02.52]也许当时忙着微笑和哭泣\n[01:08.50]忙着追逐天空中的流星\n[01:14.26]人理所当然的忘记\n[01:18.79]是谁风里雨里一直默默守护在原地\n[01:26.52]原来你是我最想留住的幸运\n[01:31.73]原来我们和爱情曾经靠得那么近\n[01:37.74]那为我对抗世界的决定\n[01:42.30]那陪我淋的雨\n[01:45.53]一幕幕都是你 一尘不染的真心\n[01:52.79]与你相遇 好幸运\n[01:56.41]可我已失去为你泪流满面的权利\n[02:02.00]但愿在我看不到的天际\n[02:06.61]你张开了双翼\n[02:09.68]遇见你的注定 (oh--)\n[02:14.57]她会有多幸运\n[02:29.54]青春是段跌跌撞撞的旅行\n[02:35.47]拥有着后知后觉的美丽\n[02:41.58]来不及感谢是你给我勇气\n[02:46.15]让我能做回我自己\n[02:51.93]也许当时忙着微笑和哭泣\n[02:57.81]忙着追逐天空中的流星\n[03:03.52]人理所当然的忘记\n[03:08.14]是谁风里雨里一直默默守护在原地\n[03:16.00]原来你是我最想留住的幸运\n[03:21.04]原来我们和爱情曾经靠得那么近\n[03:27.10]那为我对抗世界的决定\n[03:31.87]那陪我淋的雨\n[03:34.64]一幕幕都是你 一尘不染的真心\n[03:42.24]与你相遇 好幸运\n[03:45.27]可我已失去为你泪流满面的权利\n[03:51.42]但愿在我看不到的天际\n[03:55.94]你张开了双翼\n[03:59.21]遇见你的注定 (oh--)\n[04:06.83]她会有多幸运\n'
    }, {
        src: 'http://niices.qiniudn.com/%E5%B0%8F%E5%B9%B8%E8%BF%90.mp3',
        cover: 'http://my-typecho-blog.b0.upaiyun.com/usr/uploads/2016/02/462344463.jpg',
        title: '小幸运',
        author: '田馥甄',
        lrc: '[00:03.00]小幸运\n[00:06.01]\n[00:09.41]作词：徐世珍，吴辉福 作曲：JerryC\n[00:12.55]演唱：田馥甄\n[00:14.78]\n[00:16.00]我听见雨滴落在青青草地\n[00:21.87]我听见远方下课钟声响起\n[00:27.87]可是我没有听见你的声音\n[00:32.98]认真 呼唤我姓名\n[00:40.09]爱上你的时候还不懂感情\n[00:46.15]离别了才觉得刻骨 铭心\n[00:52.19]为什么没有发现遇见了你\n[00:56.70]是生命最好的事情\n[01:02.52]也许当时忙着微笑和哭泣\n[01:08.50]忙着追逐天空中的流星\n[01:14.26]人理所当然的忘记\n[01:18.79]是谁风里雨里一直默默守护在原地\n[01:26.52]原来你是我最想留住的幸运\n[01:31.73]原来我们和爱情曾经靠得那么近\n[01:37.74]那为我对抗世界的决定\n[01:42.30]那陪我淋的雨\n[01:45.53]一幕幕都是你 一尘不染的真心\n[01:52.79]与你相遇 好幸运\n[01:56.41]可我已失去为你泪流满面的权利\n[02:02.00]但愿在我看不到的天际\n[02:06.61]你张开了双翼\n[02:09.68]遇见你的注定 (oh--)\n[02:14.57]她会有多幸运\n[02:29.54]青春是段跌跌撞撞的旅行\n[02:35.47]拥有着后知后觉的美丽\n[02:41.58]来不及感谢是你给我勇气\n[02:46.15]让我能做回我自己\n[02:51.93]也许当时忙着微笑和哭泣\n[02:57.81]忙着追逐天空中的流星\n[03:03.52]人理所当然的忘记\n[03:08.14]是谁风里雨里一直默默守护在原地\n[03:16.00]原来你是我最想留住的幸运\n[03:21.04]原来我们和爱情曾经靠得那么近\n[03:27.10]那为我对抗世界的决定\n[03:31.87]那陪我淋的雨\n[03:34.64]一幕幕都是你 一尘不染的真心\n[03:42.24]与你相遇 好幸运\n[03:45.27]可我已失去为你泪流满面的权利\n[03:51.42]但愿在我看不到的天际\n[03:55.94]你张开了双翼\n[03:59.21]遇见你的注定 (oh--)\n[04:06.83]她会有多幸运\n'
    }, {
        src: 'http://niices.qiniudn.com/%E5%B0%8F%E5%B9%B8%E8%BF%90.mp3',
        cover: 'http://my-typecho-blog.b0.upaiyun.com/usr/uploads/2016/02/462344463.jpg',
        title: '小幸运',
        author: '田馥甄',
        lrc: '[00:03.00]小幸运\n[00:06.01]\n[00:09.41]作词：徐世珍，吴辉福 作曲：JerryC\n[00:12.55]演唱：田馥甄\n[00:14.78]\n[00:16.00]我听见雨滴落在青青草地\n[00:21.87]我听见远方下课钟声响起\n[00:27.87]可是我没有听见你的声音\n[00:32.98]认真 呼唤我姓名\n[00:40.09]爱上你的时候还不懂感情\n[00:46.15]离别了才觉得刻骨 铭心\n[00:52.19]为什么没有发现遇见了你\n[00:56.70]是生命最好的事情\n[01:02.52]也许当时忙着微笑和哭泣\n[01:08.50]忙着追逐天空中的流星\n[01:14.26]人理所当然的忘记\n[01:18.79]是谁风里雨里一直默默守护在原地\n[01:26.52]原来你是我最想留住的幸运\n[01:31.73]原来我们和爱情曾经靠得那么近\n[01:37.74]那为我对抗世界的决定\n[01:42.30]那陪我淋的雨\n[01:45.53]一幕幕都是你 一尘不染的真心\n[01:52.79]与你相遇 好幸运\n[01:56.41]可我已失去为你泪流满面的权利\n[02:02.00]但愿在我看不到的天际\n[02:06.61]你张开了双翼\n[02:09.68]遇见你的注定 (oh--)\n[02:14.57]她会有多幸运\n[02:29.54]青春是段跌跌撞撞的旅行\n[02:35.47]拥有着后知后觉的美丽\n[02:41.58]来不及感谢是你给我勇气\n[02:46.15]让我能做回我自己\n[02:51.93]也许当时忙着微笑和哭泣\n[02:57.81]忙着追逐天空中的流星\n[03:03.52]人理所当然的忘记\n[03:08.14]是谁风里雨里一直默默守护在原地\n[03:16.00]原来你是我最想留住的幸运\n[03:21.04]原来我们和爱情曾经靠得那么近\n[03:27.10]那为我对抗世界的决定\n[03:31.87]那陪我淋的雨\n[03:34.64]一幕幕都是你 一尘不染的真心\n[03:42.24]与你相遇 好幸运\n[03:45.27]可我已失去为你泪流满面的权利\n[03:51.42]但愿在我看不到的天际\n[03:55.94]你张开了双翼\n[03:59.21]遇见你的注定 (oh--)\n[04:06.83]她会有多幸运\n'
    }, {
        src: 'http://niices.qiniudn.com/%E5%B0%8F%E5%B9%B8%E8%BF%90.mp3',
        cover: 'http://my-typecho-blog.b0.upaiyun.com/usr/uploads/2016/02/462344463.jpg',
        title: '小幸运',
        author: '田馥甄',
        lrc: '[00:03.00]小幸运\n[00:06.01]\n[00:09.41]作词：徐世珍，吴辉福 作曲：JerryC\n[00:12.55]演唱：田馥甄\n[00:14.78]\n[00:16.00]我听见雨滴落在青青草地\n[00:21.87]我听见远方下课钟声响起\n[00:27.87]可是我没有听见你的声音\n[00:32.98]认真 呼唤我姓名\n[00:40.09]爱上你的时候还不懂感情\n[00:46.15]离别了才觉得刻骨 铭心\n[00:52.19]为什么没有发现遇见了你\n[00:56.70]是生命最好的事情\n[01:02.52]也许当时忙着微笑和哭泣\n[01:08.50]忙着追逐天空中的流星\n[01:14.26]人理所当然的忘记\n[01:18.79]是谁风里雨里一直默默守护在原地\n[01:26.52]原来你是我最想留住的幸运\n[01:31.73]原来我们和爱情曾经靠得那么近\n[01:37.74]那为我对抗世界的决定\n[01:42.30]那陪我淋的雨\n[01:45.53]一幕幕都是你 一尘不染的真心\n[01:52.79]与你相遇 好幸运\n[01:56.41]可我已失去为你泪流满面的权利\n[02:02.00]但愿在我看不到的天际\n[02:06.61]你张开了双翼\n[02:09.68]遇见你的注定 (oh--)\n[02:14.57]她会有多幸运\n[02:29.54]青春是段跌跌撞撞的旅行\n[02:35.47]拥有着后知后觉的美丽\n[02:41.58]来不及感谢是你给我勇气\n[02:46.15]让我能做回我自己\n[02:51.93]也许当时忙着微笑和哭泣\n[02:57.81]忙着追逐天空中的流星\n[03:03.52]人理所当然的忘记\n[03:08.14]是谁风里雨里一直默默守护在原地\n[03:16.00]原来你是我最想留住的幸运\n[03:21.04]原来我们和爱情曾经靠得那么近\n[03:27.10]那为我对抗世界的决定\n[03:31.87]那陪我淋的雨\n[03:34.64]一幕幕都是你 一尘不染的真心\n[03:42.24]与你相遇 好幸运\n[03:45.27]可我已失去为你泪流满面的权利\n[03:51.42]但愿在我看不到的天际\n[03:55.94]你张开了双翼\n[03:59.21]遇见你的注定 (oh--)\n[04:06.83]她会有多幸运\n'
    }, ];


    /**
     * 初始化播放器
     */
    if (!IcePlayer.musicSource) {
        IcePlayer.init({
            musicSource: IcePlayer.musicSource,
            playList: IcePlayer.localList,
            autoPlay: IcePlayer.autoPlay,
            defaultShow: IcePlayer.defaultShow,
        })
    }

    /**
     * 请求并解析网易云音乐歌单信息
     */
    if (IcePlayer.musicSource) {
        IcePlayer.netEaseList = [];
        IcePlayer.netEaseHandle = function() {
            var data;
            IcePlayer.utils.ajax({
                url: "http://www.niices.com/api/netEaseMusic/?playlist_id=" + IcePlayer.netEasePlayListId,
                success: function(responseText) {
                    data = JSON.parse(responseText);
                    for (var i = 0; i < data.result.trackCount; i++) {
                        var musicInfo = {};
                        var datum = data.result.tracks[i];
                        var datumArtistLen = datum.artists.length;
                        // 基本信息
                        musicInfo.id = datum.id;
                        musicInfo.src = datum.mp3Url;
                        musicInfo.cover = datum.album.blurPicUrl;
                        musicInfo.title = datum.name;
                        musicInfo.author = datum.artists[0].name;
                        for (var j = 1; j < datumArtistLen; j++) {
                            musicInfo.author += ("/" + datum.artists[j].name);
                        };
                        IcePlayer.netEaseList.push(musicInfo);
                    }
                    IcePlayer.init({
                        musicSource: IcePlayer.musicSource,
                        playList: IcePlayer.netEaseList,
                        autoPlay: IcePlayer.autoPlay,
                        defaultShow: IcePlayer.defaultShow,
                    })
                },
                fail: function() {
                    console.error("拉取歌单失败")
                }
            })
        }
        IcePlayer.netEaseHandle()
    }
}
